{"0":{"Title":"Apple Increases Apple Music Subscription Price for Students in Several Countries","Author":"Sami Fathi","PublishedAt":"2022-05-22T08:57:51Z","FullArticle":"Apple has silently increased the price of its Apple Music subscription for college students in several countries, with the company emailing students informing them their subscription would be slightl… [+1014 chars]"},"1":{"Title":"EXCLUSIVE General Atlantic plans $2 billion investment in India, Southeast Asia - Reuters.com","Author":null,"PublishedAt":"2022-05-22T17:16:00Z","FullArticle":"DAVOS, Switzerland, May 22 (Reuters) - Global private equity firm General Atlantic plans to plough $2 billion into India and Southeast Asia over the next two years after falling valuations made the r… [+2307 chars]"},"2":{"Title":"Apocalypse now? The alarming effects of the global food crisis","Author":"Simon Tisdall","PublishedAt":"2022-05-21T13:25:20Z","FullArticle":"Apocalypse is an alarming idea, commonly taken to denote catastrophic destruction foreshadowing the end of the world. But in the original Greek,apokálypsismeans a revelation or an uncovering. One ver… [+15039 chars]"},"3":{"Title":"Rural Philippines, Long Neglected, Newly Appealing in Covid Times","Author":"Sammy Westfall","PublishedAt":"2022-05-22T13:34:43Z","FullArticle":"Ms. Zilmar, 50, had spent five years in Manila as a maid and a food court cashier to help pay the college tuition of five children. When the food court closed early in the pandemic, she moved in with… [+1047 chars]"},"4":{"Title":"Apple Music raises prices for Student plan in multiple countries","Author":"news@appleinsider.com (Malcolm Owen)","PublishedAt":"2022-05-22T12:02:59Z","FullArticle":"AppleInsider is supported by its audience and may earn commission as an Amazon Associate and affiliate partner on qualifying purchases. These affiliate partnerships do not influence our editorial con… [+1460 chars]"},"5":{"Title":"Future foods: What you could be eating by 2050","Author":"https:\/\/www.facebook.com\/bbcnews","PublishedAt":"2022-05-22T00:30:47Z","FullArticle":"By Helen BriggsEnvironment correspondent\r\nImage source, Getty Images\r\nImage caption, Just three crops are the staple for more than four billion people\r\nScientists have drawn up a list of little-known… [+3508 chars]"},"6":{"Title":"Funniest\/Most Insightful Comments Of The Week At Techdirt","Author":"Leigh Beadon","PublishedAt":"2022-05-22T19:03:00Z","FullArticle":"from the what's-the-word dept\r\nThis week, our first place winner on the insightful side is an anonymous comment about New York’s blatantly unconstitutional investigation into online platforms in the … [+2739 chars]"},"7":{"Title":"Missing Picasso Resurfaces at Home of Former Philippines First Lady","Author":"Elaine Velie","PublishedAt":"2022-05-22T20:01:00Z","FullArticle":"After winning the presidential election in the Philippines last week, Ferdinand Bongbong Marcos, Jr. made a publicized visit to the home of his mother, Imelda Marcos. In the background of their meeti… [+3511 chars]"},"8":{"Title":"Apple Music cho sinh viên tại Việt Nam tăng giá từ 29k lên 35k, còn lại không đổi","Author":"giahuy0308@outlook.com (Pnghuy), Pnghuy","PublishedAt":"2022-05-22T18:34:51Z","FullArticle":"Hin ti Apple cung cp 4 gói dch v Apple Music, ti Vit Nam thì s có gói cá nhân (59k\/tháng), gói gia ình (89k\/tháng) và gói sinh viên (giá c là 29k) và mi ây, gói dành cho hc sinh sinh viên ã tng giá t… [+792 chars]"},"9":{"Title":"First Case of Omicron BA.4 Variant Detected in Philippines","Author":"Sputnik International","PublishedAt":"2022-05-21T16:05:24Z","FullArticle":"https:\/\/sputniknews.com\/20220521\/first-case-of-omicron-ba4-variant-detected-in-philippines-1095690435.html\r\nFirst Case of Omicron BA.4 Variant Detected in Philippines\r\nFirst Case of Omicron BA.4 Vari… [+1675 chars]"}}